package simulator.playerdata;

import java.util.List;

public class BuffalosData implements TeamPlayersDataInterface {

	private final static String CSV = "\"Ｔ－岡田\",\"504\",\"134\",\"19\",\"0\",\"31\",\"83\"\n"
									  + "\"小谷野栄一\",\"470\",\"130\",\"14\",\"1\",\"6\",\"28\"\n"
									  + "\"中島宏之\",\"431\",\"123\",\"19\",\"0\",\"9\",\"46\"\n"
									  + "\"ロメロ\",\"390\",\"107\",\"13\",\"0\",\"26\",\"27\"\n"
									  + "\"大城滉二\",\"345\",\"85\",\"10\",\"1\",\"2\",\"16\"\n"
									  + "\"安達了一\",\"316\",\"64\",\"9\",\"3\",\"3\",\"37\"\n"
									  + "\"西野真弘\",\"282\",\"66\",\"11\",\"2\",\"2\",\"24\"\n"
									  + "\"駿太\",\"296\",\"71\",\"16\",\"7\",\"2\",\"15\"\n"
									  + "\"マレーロ\",\"283\",\"82\",\"15\",\"1\",\"20\",\"29\"";

	@Override
	public List<PlayerData> getPlayerData() {
		return PlayersDataUtil.getPlayerData(CSV);
	}
}