package simulator.playerdata;

import java.util.List;

public class EaglesData implements TeamPlayersDataInterface {

	private final static String CSV = "\"ウィーラー\",\"542\",\"147\",\"27\",\"0\",\"31\",\"50\"\n"
									  + "\"銀次\",\"529\",\"155\",\"30\",\"0\",\"3\",\"56\"\n"
									  + "\"島内宏明\",\"494\",\"131\",\"14\",\"3\",\"14\",\"64\"\n"
									  + "\"ペゲーロ\",\"463\",\"130\",\"17\",\"1\",\"26\",\"50\"\n"
									  + "\"アマダー\",\"417\",\"99\",\"9\",\"0\",\"23\",\"39\"\n"
									  + "\"茂木栄五郎\",\"398\",\"118\",\"25\",\"2\",\"17\",\"45\"\n"
									  + "\"岡島豪郎\",\"342\",\"89\",\"13\",\"5\",\"3\",\"41\"\n"
									  + "\"嶋基宏\",\"281\",\"56\",\"9\",\"0\",\"3\",\"57\"\n"
									  + "\"藤田一也\",\"270\",\"68\",\"9\",\"2\",\"3\",\"16\"\n";

	@Override
	public List<PlayerData> getPlayerData() {
		return PlayersDataUtil.getPlayerData(CSV);
	}
}