package simulator.playerdata;

import java.util.List;

public class HawksData implements TeamPlayersDataInterface {

	private final static String CSV = "\"今宮健太\",\"526\",\"139\",\"27\",\"7\",\"14\",\"38\"\n"
									  + "\"中村晃\",\"511\",\"138\",\"19\",\"2\",\"6\",\"67\"\n"
									  + "\"松田宣浩\",\"531\",\"140\",\"19\",\"6\",\"24\",\"43\"\n"
									  + "\"柳田悠岐\",\"448\",\"139\",\"30\",\"1\",\"31\",\"89\"\n"
									  + "\"デスパイネ\",\"478\",\"125\",\"15\",\"0\",\"35\",\"59\"\n"
									  + "\"上林誠知\",\"415\",\"108\",\"23\",\"5\",\"13\",\"24\"\n"
									  + "\"明石健志\",\"290\",\"81\",\"10\",\"3\",\"1\",\"30\"\n"
									  + "\"内川聖一\",\"266\",\"79\",\"13\",\"0\",\"12\",\"32\"\n"
									  + "\"甲斐拓也\",\"207\",\"48\",\"8\",\"3\",\"5\",\"26\"\n";

	@Override
	public List<PlayerData> getPlayerData() {
		return PlayersDataUtil.getPlayerData(CSV);
	}
}